trade_exp/src/InformationRegisters/СостоянияРассылокОтчетов/СостоянияРассылокОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0333cd9e-392d-40b2-869d-ad47119e0384">
  <name>СостоянияРассылокОтчетов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="8e0340c9-6469-4fc9-b19a-4be4e0e6ee82">
    <name>УспешныйЗапуск</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="82cc8820-0b92-4bb7-b097-7ac79e922f01">
    <name>ПоследнийЗапускНачало</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="243d201b-3714-4700-b410-c74c9093e6f6">
    <name>СОшибками</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="f2267d6c-6972-4621-b677-87798056363b">
    <name>Выполнена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="de3cb50c-ef99-419e-b922-c6a453da6a5b">
    <name>Рассылка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/СостоянияРассылокОтчетов/ManagerModule.bsl
&Вместо("ЗафиксироватьРезультатВыполненияРассылки")
Процедура Док_ЗафиксироватьРезультатВыполненияРассылки(Рассылка, РезультатВыполнения)
	УстановитьПривилегированныйРежим(Истина);

	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных();
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СостоянияРассылокОтчетов");
		ЭлементБлокировки.УстановитьЗначение("Рассылка", Рассылка);
		Блокировка.Заблокировать();

		МенеджерЗаписи = СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Рассылка = Рассылка;
		МенеджерЗаписи.Прочитать();

		МенеджерЗаписи.Рассылка = Рассылка;
		МенеджерЗаписи.СОшибками = РезультатВыполнения.БылиОшибки ИЛИ РезультатВыполнения.БылиПредупреждения;
		Если РезультатВыполнения.БылиОшибки ИЛИ РезультатВыполнения.БылиПредупреждения Тогда 
			МенеджерЗаписи.Выполнена = Ложь; 
		Иначе
			МенеджерЗаписи.Выполнена = РезультатВыполнения.ВыполненаВПапку
										Или РезультатВыполнения.ВыполненаВСетевойКаталог
										Или РезультатВыполнения.ВыполненаНаFTP
										Или РезультатВыполнения.ВыполненаПоЭлектроннойПочте;
		КонецЕсли; 
		Если МенеджерЗаписи.Выполнена Тогда
			МенеджерЗаписи.УспешныйЗапуск = МенеджерЗаписи.ПоследнийЗапускНачало;
		КонецЕсли;
		МенеджерЗаписи.ПоследнийЗапускЗавершение = ТекущаяДатаСеанса();

		МенеджерЗаписи.Записать(Истина);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры
